<?php
/**
*  Написати програму на PHP, яка порівнює різні типи даних (цілі числа, рядки, логічні значення та інші)
*  за допомогою операторів суворого і несуворого порівняння та виводить результат порівняння на екран.
*  В програмі потрібно використати мінімум п'ять різних типів даних
*  та мінімум по два порівняння (з використанням суворого та несуворого порівняння).
*
*  Використати приведення типів і повторити суворе і несуворе порівняння
*
*/


// Різні типи даних
$integer = 42; // ціле число
$float = 3.14; // десяткове число
$string = "Hello, world!"; // рядок
$boolean = true; // логічне значення (true)
$array = [1, 2, 3]; // масив

// Порівняння з використанням суворого порівняння
echo "Суворе порівняння:\n";
var_dump($integer === $float); // false
var_dump($string === "Hello, world!"); // true
var_dump($boolean === true); // true
var_dump($array === [1, 2, 3]); // true

// Порівняння з використанням несуворого порівняння
echo "\nНесуворе порівняння:\n";
var_dump($integer == $float); // false
var_dump($string == "Hello, world!"); // true
var_dump($boolean == true); // true
var_dump($array == [1, 2, 3]); // true